/*
数论笔记：
问题：怎么解同余方程 f(x):a_n*x^n+a_n-1*x^n-1+...+a_0=0 (mod m)
如果对m=p1^a1*p2*a1*...*pk^ak的每个pi^ai都能求出解，那最后用crt合并即可 

问题转化为求解 f(x)=0 (mod p^a)
考虑递推求解，如果已经求出 f(x)=0 (mod p^(a-1)) 的解x0（a>=2），将x=x0+t*p^(a-1)带入得
	f(x0+t*p^(a-1)) = 0 mod(p^a)
<=> f(x0)+t*p^(a-1)*f'(x0) = 0 mod(p^a)
<=> t*f'(x0) = -f(x0)/p^(a-1) mod(p^a)
<=> t = -f(x0)/p^(a-1)*(f'(x0))^-1 mod(p^a)

于是问题化为求解f(x)=0 (mod p) 
当f(x)为一次多项式时，用exgcd解决
当f(x)为二次多项式时，用二次剩余解决 
--------------------------------------------------------------------------------------------

*/
